hw4/app/controllers/dogs_controller.rb

  def create
    @dog = Dog.new(dog_params)
    if @dog.save
---
INSERT INTO "dogs" ("age", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["age", 3], ["created_at", "2016-02-24 01:20:39.992976"], ["name", "petty"], ["updated_at", "2016-02-24 01:20:39.992976"]]